{
    "version": "https://jsonfeed.org/version/1",
    "title": "dill.moe",
    "description": "",
    "home_page_url": "https://dill.moe",
    "feed_url": "https://dill.moe/feed.json",
    "user_comment": "",
    "author": {
        "name": "Cross"
    },
    "items": [
        {
            "id": "https://dill.moe/what-if-porter-robinson-released-knock-yourself-out-xd-in-2021/",
            "url": "https://dill.moe/what-if-porter-robinson-released-knock-yourself-out-xd-in-2021/",
            "title": "What if Porter Robinson released KNOCK YOURSELF OUT XD in 2021?",
            "summary": "I really wanted to take KNOCK YOURSELF OUT XD by Porter Robinson and add a Nurture/Worlds flare to it. And I finally did just that. The main changes are the addition of the \"nurture\" voice which is just a pitched up and formant adjusted version&hellip;",
            "content_html": "<p>I really wanted to take KNOCK YOURSELF OUT XD by Porter Robinson and add a Nurture/Worlds flare to it. And I finally did just that.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://dill.moe/media/posts/9/Screenshot-2024-05-26-192637.png\" alt=\"\" width=\"1918\" height=\"1029\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-xs.png 640w ,https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-sm.png 768w ,https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-md.png 1024w ,https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-lg.png 1366w ,https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-xl.png 1600w ,https://dill.moe/media/posts/9/responsive/Screenshot-2024-05-26-192637-2xl.png 1920w\">\n<figcaption >The FL Studio Project</figcaption>\n</figure>\n<p><br>The main changes are the addition of the \"nurture\" voice which is just a pitched up and formant adjusted version of Porter's own voice.</p>\n<p>I layered this with his original voice with tons of mastering and post processing such as vocal doubling and a stereo enhancer on the original base voice.</p>\n<p>To get the stems I used a band-split roformer model, which is a neural network designed to split vocals from instrumentals. I hand adjusted the model's configuration for improved results.</p>\n<p>Another major addition is the subtle but impactful \"aaahhhs\" added to the chorus and other louder parts of the song. It's sort of a choir holding a single note, which was achieved by time stretching Porter's (pitched) voice and applying a convolver to it with a \"white noise blur\" (heavily adjusted). It resulted in that nurturey sort of emotional anime vibe.</p>\n<p>I bit crushed the very beginning of the song, as well as another part of the song that plays the square wave lead. This leads to a more arcade, \"worlds\" type sound. Which I think is really cool!</p>\n<p>I ran the roformer instrumental stem through finetuned demucs, which can split the track into 4 stems, being: Vocals (which is irrelevant), Other, Bass, and Drums. The track I specifically targeted was the \"Other\" which contains everything except the others, and usually contains synths, guitars, piano, etc. I put this once at the beginning of the song, and a second time at the beginning of the second chorus, with that one having a sweeping highpass filter to give an \"opening up\" effect.</p>\n<p>Overall, this took me about 2 ish hours to get right. Mostly the balancing, effects, and getting everything juuuust right!</p>\n<p>The final sound is rich, full, and IMO, it sounds professionally produced and possibly the same level of mastering and production as the original.<br><br>Here is the song! I hope you enjoy it as much as I did making it! :)</p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/pEL-m3-1_E0?si=aMPd1U9mKLWEmTCL\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>",
            "author": {
                "name": "Cross"
            },
            "tags": [
                   "Blog"
            ],
            "date_published": "2024-05-26T02:39:00-04:00",
            "date_modified": "2025-03-19T17:45:18-04:00"
        },
        {
            "id": "https://dill.moe/a-bit-about-arnold-palmer/",
            "url": "https://dill.moe/a-bit-about-arnold-palmer/",
            "title": "A Bit About Arnold Palmer",
            "summary": "The Arnold Palmer, a delightful beverage named after the legendary golfer, is a harmonious blend of iced tea and lemonade, creating a symphony of flavors that tantalizes the taste buds and refreshes the spirit. This iconic drink is renowned for its perfect balance of sweetness&hellip;",
            "content_html": "<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://dill.moe/media/posts/5/ARNOLD-PALMER-DRINK-2.jpg\" alt=\"\" width=\"276\" height=\"414\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-xs.jpg 640w ,https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-sm.jpg 768w ,https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-md.jpg 1024w ,https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-lg.jpg 1366w ,https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-xl.jpg 1600w ,https://dill.moe/media/posts/5/responsive/ARNOLD-PALMER-DRINK-2-2xl.jpg 1920w\"></figure>\n<p>The Arnold Palmer, a delightful beverage named after the legendary golfer, is a harmonious blend of iced tea and lemonade, creating a symphony of flavors that tantalizes the taste buds and refreshes the spirit. This iconic drink is renowned for its perfect balance of sweetness and tartness, making it an instant favorite among both avid tea drinkers and lemonade enthusiasts alike.</p>\n<p>What makes the Arnold Palmer truly exceptional is its versatility. Whether sipped leisurely on a hot summer day or enjoyed as a revitalizing pick-me-up during any season, this timeless concoction never fails to deliver satisfaction. Its crispness invigorates the senses, while its smooth texture glides over the palate with effortless grace, leaving behind a lingering sensation of pure refreshment.</p>\n<p>Beyond its impeccable taste, the Arnold Palmer carries with it a sense of tradition and nostalgia. Originating as a custom order by Arnold Palmer himself, this beverage has transcended its humble beginnings to become a beloved classic enjoyed by people of all ages across the globe. Its simplicity belies its impact, as it continues to evoke fond memories of lazy afternoons spent with loved ones and cherished moments shared among friends.</p>\n<p>In addition to its irresistible flavor and sentimental value, the Arnold Palmer embodies the essence of relaxation and enjoyment. Whether enjoyed on the golf course, at a picnic, or simply lounging at home, this timeless drink has the remarkable ability to elevate any moment, turning the ordinary into something truly extraordinary. With its enduring popularity and universal appeal, the Arnold Palmer stands as a testament to the enduring power of simplicity and the joy found in life's simplest pleasures.</p>",
            "author": {
                "name": "Cross"
            },
            "tags": [
                   "Blog"
            ],
            "date_published": "2024-02-15T17:14:12-05:00",
            "date_modified": "2025-03-19T17:45:43-04:00"
        }
    ]
}
